In [33]:
import pyforest

In [34]:
data = pd.read_csv('F:/ML Datasets/salaries.csv')
data.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [35]:
data.isnull()

    company    job  degree  salary_more_then_100k
0     False  False   False                  False
1     False  False   False                  False
2     False  False   False                  False
3     False  False   False                  False
4     False  False   False                  False
5     False  False   False                  False
6     False  False   False                  False
7     False  False   False                  False
8     False  False   False                  False
9     False  False   False                  False
10    False  False   False                  False
11    False  False   False                  False
12    False  False   False                  False
13    False  False   False                  False
14    False  False   False                  False
15    False  False   False                  False

In [36]:
x = data.drop('salary_more_then_100k', axis='columns')
target = data['salary_more_then_100k']

In [37]:
x.head()

  company                  job     degree
0  google      sales executive  bachelors
1  google      sales executive    masters
2  google     business manager  bachelors
3  google     business manager    masters
4  google  computer programmer  bachelors

In [38]:
target.head()

0    0
1    0
2    1
3    1
4    0
Name: salary_more_then_100k, dtype: int64

In [39]:
from sklearn.preprocessing import LabelEncoder

In [40]:
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [41]:
x['company_n'] = le_company.fit_transform(x['company'])
x['job_n'] = le_company.fit_transform(x['job'])
x['degree_n'] = le_company.fit_transform(x['degree'])

In [42]:
x.head()

  company                  job     degree  company_n  job_n  degree_n
0  google      sales executive  bachelors          2      2         0
1  google      sales executive    masters          2      2         1
2  google     business manager  bachelors          2      0         0
3  google     business manager    masters          2      0         1
4  google  computer programmer  bachelors          2      1         0

In [43]:
inputs_n = x.drop(['company','job','degree'], axis = 'columns')

In [44]:
from sklearn import tree

In [45]:
model = tree.DecisionTreeClassifier()

In [46]:
model.fit(inputs_n, target)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [47]:
model.score(inputs_n, target)

1.0

In [49]:
model.predict([[2,2,1]])

array([0], dtype=int64)